title: Screen Saver execution
id: 951b081e-fe98-11ea-adc1-0242ac120002
description: Detects execution of any screen saver files (.scr). Follow instructions in 'references' section to disable screen savers first by GPO before using this rule.
status: experimental
date: 2020/09/24
modified:
author: Christopher Bukavich @darkcaracal
references:
    - https://medium.com/@darkcaracal/analysis-of-malicious-screen-saver-files-adb3b7c01939
tags:
    - attack.execution
    - attack.persistence
    - attack.t1204.002
    - attack.t1546.002
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 1
        Image|endswith: '.scr'
    condition: selection
fields:
    - Image
falsepositives:
    - Without disabling by GPO screensavers or another method you will see process creation as normal activity. After disabling by GPO process creation should not be occuring with a majority of end users.
level: medium
